-- 创建档口表 Merchant
CREATE TABLE Merchant (
    MerchantID CHAR(5) PRIMARY KEY,       -- 主键：档口编号
    MName NVARCHAR(50) NOT NULL,           -- 档口名称
    Location NVARCHAR(50),                -- 档口位置
    Manager NVARCHAR(50) ,                 -- 负责人姓名
    Phone  VARCHAR(20)                     --负责人电话
);
-- 插入20条档口数据
INSERT INTO Merchant (MerchantID, MName, Location, Manager, Phone) VALUES
('01101', N'川湘小厨', N'一食堂一楼-01', N'王晓刚', '13810015501'),
('01102', N'清真牛肉面', N'一食堂一楼-02', N'马丽娟', '13920025502'),
('01201', N'特色面食', N'一食堂二楼-01', N'杨秀珍', '13030035503'),
('02101', N'粤式甜品站', N'二食堂一楼-01', N'陈宇飞', '13140045504'),
('02102', N'沙县小吃', N'二食堂一楼-02', N'冯建国', '13250055505'),
('02201', N'东北水饺', N'二食堂二楼-01', N'李德华', '13360065506'),
('02202', N'养生粥铺', N'二食堂二楼-02', N'陈欣怡', '13470075507'),
('03101', N'韩式拌饭', N'三食堂一楼-01', N'金明秀', '13580085508'),
('03102', N'小笼包', N'三食堂一楼-02', N'韩志强', '13690095509'),
('03201', N'西式披萨', N'三食堂二楼-01', N'张伟东', '13700105510');