CREATE TABLE Student (
    StudentID CHAR(12) PRIMARY KEY,
    SName NVARCHAR(50) NOT NULL,
    Sex CHAR(1) NOT NULL,
    Major NVARCHAR(50) NOT NULL,
    Balance DECIMAL(10,2) DEFAULT 0.00 CHECK (Balance >= 0.00),
    Points DECIMAL(10,2) DEFAULT 0.00 CHECK (Points >= 0.00)
);
INSERT INTO Student (StudentID, SName, Sex, Major, Balance, Points) VALUES
('202411040101', N'林思怡', 'F', N'计算机科学', 88.25, 120),
('202411040102', N'李芷', 'F', N'计算机科学', 12.00, 10),
('202411040103', N'张超', 'M', N'计算机科学', 180.10, 400),
('202411040104', N'王凯', 'M', N'计算机科学', 400.20, 950),
('202411040105', N'刘明', 'M', N'计算机科学', 280.75, 600),
('202411040501', N'赵强', 'M', N'信息工程', 210.90, 450),
('202411040502', N'周晨', 'M', N'信息工程', 45.30, 60),
('202411040503', N'钱宁', 'M', N'信息工程', 75.60, 90),
('202411040504', N'孙浩', 'M', N'信息工程', 165.40, 300),
('202411040301', N'陈小宇', 'M', N'网络工程', 150.50, 350),
('202411040302', N'杨菲', 'F', N'网络工程', 55.70, 50),
('202411040303', N'何勇', 'M', N'网络工程', 600.50, 1200),
('202411040304', N'郑敏', 'F', N'网络工程', 99.00, 150),
('202411040305', N'顾婧', 'F', N'网络工程', 110.00, 200),
('202411040306', N'许琳', 'F', N'网络工程', 22.90, 20);
INSERT INTO Student (StudentID, SName, Sex, Major, Balance, Points) VALUES
('202411040307', N'王强', 'M', N'网络工程', 200.50, DEFAULT),
('202411040505', N'李明', 'M', N'信息工程', DEFAULT, DEFAULT),
('202411040107', N'赵雅', 'F', N'计算机科学', DEFAULT, 150),
('202411040308', N'陈磊', 'M', N'网络工程', 80.00, DEFAULT);