CREATE TABLE Student (
    StudentID CHAR(12) PRIMARY KEY,
    SName NVARCHAR(50) NOT NULL,
    Sex CHAR(1) NOT NULL,
    Major NVARCHAR(50) NOT NULL,
    Balance DECIMAL(10,2) DEFAULT 0.00 CHECK (Balance >= 0.00),
    Points DECIMAL(10,2) DEFAULT 0.00 CHECK (Points >= 0.00)
);
INSERT INTO Student (StudentID, SName, Sex, Major, Balance, Points) VALUES
('202411040101', N'李思颖', 'F', N'计算机科学', 88.25, 120),
('202411040102', N'陈芳', 'F', N'计算机科学', 12.00, 10),
('202411040103', N'冯斌', 'M', N'计算机科学', 180.10, 400),
('202411040104', N'顾俊', 'M', N'计算机科学', 400.20, 950),
('202411040105', N'郭磊', 'M', N'计算机科学', 280.75, 600),
('202411040501', N'刘强', 'M', N'电子信息', 210.90, 450),
('202411040502', N'吴磊', 'M', N'电子信息', 45.30, 60),
('202411040503', N'钱进', 'M', N'电子信息', 75.60, 90),
('202411040504', N'朱明', 'M', N'电子信息', 165.40, 300),
('202411040301', N'王小明', 'M', N'软件工程', 150.50, 350),
('202411040302', N'赵丽', 'F', N'软件工程', 55.70, 50),
('202411040303', N'孙涛', 'M', N'软件工程', 600.50, 1200),
('202411040304', N'郑红', 'F', N'软件工程', 99.00, 150),
('202411040305', N'杜娟', 'F', N'软件工程', 110.00, 200),
('202411040306', N'蔡琳', 'F', N'软件工程', 22.90, 20);
INSERT INTO Student (StudentID, SName, Sex, Major, Balance, Points) VALUES
('202411040307', N'林强', 'M', N'软件工程', 200.50, DEFAULT),
('202411040505', N'赵鑫', 'M', N'电子信息', DEFAULT, DEFAULT),
('202411040107', N'徐婷', 'F', N'计算机科学', DEFAULT, 150),
('202411040308', N'马珂', 'M', N'软件工程', 80.00, DEFAULT);